#include "function.h"
#include <iostream>
using namespace std;


void menu() // Вывод основного меню программы
{
	cout << "|-------------------------------------------------|" << endl;
	cout << "|Операции                                         |" << endl;
	cout << "|-------------------------------------------------|" << endl;
	cout << "| 1. Добавить товар                               |" << endl;
	cout << "|-------------------------------------------------|" << endl;
	cout << "| 2. Ввести значения в таблицу расходов           |" << endl;
	cout << "|-------------------------------------------------|" << endl;
	cout << "| 3. Ввести сумму оплаты в таблицу доходов        |" << endl;
	cout << "|-------------------------------------------------|" << endl;
	cout << "| 4. Закупки                                      |" << endl;
	cout << "|-------------------------------------------------|" << endl;
	cout << "| 5. Вывести список товаров/Редактировать         |" << endl;
	cout << "|-------------------------------------------------|" << endl;
	cout << "| 6. Вывести таблицу доходов                      |" << endl;
	cout << "|-------------------------------------------------|" << endl;
	cout << "| 7. Вывести таблицу расходов                     |" << endl;
	cout << "|-------------------------------------------------|" << endl;
	cout << "| 8. Вывести Годовой отчет                        |" << endl;
	cout << "|-------------------------------------------------|" << endl;
	cout << "| 0. Закрыть программу                            |" << endl;
	cout << "|-------------------------------------------------|" << endl;
	cout << "| Выберите операцию: ";
}

void punkt5() // Вывод списка действий с товарами
{
	cout << "|---------------------------|" << endl;
	cout << "|Действия:                  |" << endl;
	cout << "|---------------------------|" << endl;
	cout << "|1. Вывести список товаров  |" << endl;
	cout << "|---------------------------|" << endl;
	cout << "|2. Редактировать товар     |" << endl;
	cout << "|---------------------------|" << endl;
	cout << "|0. Вернуться в меню        |" << endl;
	cout << "|---------------------------|" << endl;
	cout << "|Выберите действие: ";
}